In [1]:
import numpy as np
import pandas as pd
np.random.seed(1)
dates = pd.date_range('20160101', periods=6)
df = pd.DataFrame(np.random.randint(100,size = (6,4)), index=dates, columns=['A', 'B', 'C', 'D'])
df

             A   B   C   D
2016-01-01  37  12  72   9
2016-01-02  75   5  79  64
2016-01-03  16   1  76  71
2016-01-04   6  25  50  20
2016-01-05  18  84  11  28
2016-01-06  29  14  50  68

In [ ]:
# 1、得到所有列的均值

In [ ]:
# 2、将表按照C列以升序排列

In [ ]:
# 3、用两种方法获得表中的值‘1’并将其更改为‘111’

In [ ]:
# 4、将A列中大于30的数字转化为100

In [ ]:
# 5、加入一列全为空值的列‘ABCD’